/** Замість того, щоб повертати результат ділення, операція за модулем (%)
 * повертає цілочисельну остачу від ділення двох чисел - діленого і дільника.
 *
 * 5 % 1 = 0;
 * // 5, поділене на 1, дорівнює 5, а остача - 0
 *
 * 5 % 2 = 1;
 * //  5, поділене на 2, дорівнює 2, а остача - 1
 *
 * 5 % 3 = 2;
 * //  5, поділене на 3, дорівнює 1, а остача - 2
 *
 * 5 % 4 = 1;
 * //  5, поділене на 4, дорівнює 1, а остача - 1
 *
 * 5 % 5 = 0;
 * //  5, поділене на 5, дорівнює 1, а остача - 0
 *
 * Доповни вираз остачі від ділення таким чином, щоб код проходив тести.
 * Значення змінної a - це число 0
 * Значення змінної b - це число 1
 * Значення змінної c - це число 3
 * Значення змінної d - це число 5
 * Значення змінної e - це число 2
 */

// Change code below this line
const a = 3 % 3;
const b = 4 % 3;
const c = 11 % 4;
const d = 12 % 7;
const e = 8 % 3;

// -----------------------------------------
console.log(a);
console.log(b);
console.log(c);
console.log(d);
console.log(e);
